app/controllers/api/v1/api_controller.rb

SELECT "product_details".* FROM "product_details" WHERE "product_details"."status" = $1  [["status", true]]
---
	def products
		@products = ProductDetail.where(status: true)

INSERT INTO "articles" ("name", "author", "title", "description", "url", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def url_paser
		require 'net/http'
		require 'json'

		url = 'https://newsapi.org/v2/top-headlines?sources=google-news&apiKey=0a708bae59cd4f92b26a6bc4c114f1f0'
		uri = URI(url)
		response = Net::HTTP.get(uri)
		data =  JSON.parse(response)

		data['articles'].each do |art|
			article = Article.create(name: art['source']['name'], author: art['author'],title: art['title'], description: art['description'], url: art['url'], utlToImage: art['utlToImage'], published_at: art['published_at'], content: art['content'])