app/controllers/home_controller.rb

SELECT "product_details".* FROM "product_details"
---
  def index
  	@product = ProductDetail.all